In [20]:
import pandas as pd

# print dataframe
data = {
    "Name": ["Rose", "John", "Jane", "Mary"],
    "ID": [1, 2, 3, 4],
    "Department": [
        "Architect Group",
        "Software Group",
        "Design Team",
        "Infrastructure",
    ],
    "Salary": [100000, 80000, 50000, 60000],
}

df = pd.DataFrame(data)

# print dataframe
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [21]:
# print dataframe column
id = df[["ID"]]
id

   ID
0   1
1   2
2   3
3   4

In [ ]:
# Retrieving the Department, Salary and ID columns and assigning it to a variable data
data = df[["Department", "Salary", "ID"]]
data

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [23]:
type(data)

pandas.core.frame.DataFrame

In [24]:
# Access the value on the first row and the first column
df.iloc[0, 0]

'Rose'

In [25]:
# Access the value on the first row and the third column
df.iloc[0, 2]

'Architect Group'

In [27]:
# Access the column using the name
df.loc[0, "Salary"]

np.int64(100000)